; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Onur AYDIN <macerron@gmail.com>
;
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "Э&ptal"
MAIN_ARCHIVE_LABEL = "Arюi&v geзmiюini tara"
MAIN_DEBUG_LABEL = "Hata dosyasэ&nэ buraya kaydet"
MAIN_DEST_DIR_LABEL = "Hede&f dizin:"
MAIN_FILE_LABEL = "Зэ&kartэlacak Arюiv/Yьkleyici:"
MAIN_LANG_LABEL = "Di&l"
MAIN_PREFS_LABEL = "%s Tercihler"
MENU_FILE_LABEL = "&Dosya"
MENU_FILE_QUIT_LABEL = "&Зэkэю"
MENU_EDIT_LABEL = "Dь&zenle"
MENU_EDIT_PREFS_LABEL = "&Ayarlar"
MENU_HELP_LABEL = "&Yardэm"
MENU_HELP_WEB_LABEL = "%s &Web Site"
PREFS_TITLE_LABEL = "Ayarlar"
PREFS_UNIEXTRACT_OPTS_LABEL = "Universal Extractor Цzellikleri"
PREFS_HISTORY_LABEL = "Arюiv tarihi izi sьrmeye devam &et"
PREFS_FORMAT_OPTS_LABEL = "Tьr-Belirli Цzellikler"
PREFS_LANG_LABEL = "Di&l"
PREFS_DEBUG_LABEL = "&Dosya dizinini onar:"
PREFS_WARN_EXECUTE_LABEL = "Dosyalarэ зalэюtэmadan цnce &uyar"
PREFS_REMOVE_DUPE_LABEL = "&Suret dosyalarэ sil"
PREFS_REMOVE_TEMP_LABEL = "Geзici dosyalarэ sil"
PREFS_APPEND_EXT_LABEL = "Eksik dosya uzantэlarэnэ tama&mla"
METHOD_ADMIN_RADIO = "%s Yцnetimsel yьklemeler"
METHOD_EXTRACTION_RADIO = "%s зэkartma"
METHOD_HEADER = "%s Зэkartma"
METHOD_MSI_NOTE_LABEL = "Not:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml gereksinim duyuyor"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Derleyici"


METHOD_RADIO_LABEL = "Зэkartma metodu"
METHOD_SWITCH_RADIO = "%s deрiюtir"
METHOD_NOTIS_RADIO = "Bu bir InstallShield yьklemesi deрildir"
METHOD_TEXT_LABEL = "%s зэkartmak iзin aюaрэdaki metodlarэ destekler %s paketleri.  Ne yazэk ki, metodlarэn hiз biri %100 gьvenilir deрildir.  Eрer varsayэlan method зalэюmэyorsa, lьtfen tekrar зalэюtэrэn %s ve baюka bir method seзin."
METHOD_UNPACKER_RADIO = "%s Ayэrэcэ"

; GUI control functions
DOES_NOT_EXIST = "bцyle birюey yok.%n"
EXTRACT_TO = "Seзilen konuma зэkart"
INVALID_DIR_SELECTED =  "%s geзerli bir dizin deрil."
INVALID_FILE_SELECTED = "%sLьtfen geзerli bir dosya seзin."
OPEN_FILE = "Dosya aз"
SELECT_FILE = "Dosya seз"
WRITE_TO = "Hata Dosyasэnэ Buraya kaydet"

; Common terms
TERM_ARCHIVE = "Arюiv"
TERM_COMPRESSED = "sэkэюtэrэlmэю dosya"
TERM_DISK = "disk"
TERM_EBOOK = "e-kitap"
TERM_ECARD = "e-kart"
TERM_ENCODED = "юifrelenmiю dosya"
TERM_EXECUTABLE = "зalэюtэrэlabilir"
TERM_FAILED = "baюarэsэz"
TERM_HELP = "Yardэm dosyasэ"
TERM_HOTFIX = "ipucu"
TERM_IMAGE = "resim"
TERM_INSTALLER = "yьkleyici"
TERM_PACKAGE = "paket"
TERM_PATCH = "yama"
TERM_SFX = "Kendi-Ayэklayэcэ"
TERM_STAGE = "Aюama"
TERM_SUCCEEDED = "baюarэlэ"
TERM_TESTING = "Deniyor"
TERM_UNKNOWN = "bilinmeyen"
TERM_UNPACKED = "paketsiz"
TERM_UPDATER = "gьncelleyici"

; Status messages
SCANNING_FILE = "Dosya, tipini belirlemek iзin taranэyor."
SCANNING_EXE = "Dosya bununla taranэyor %s."
EXTRACTING = "Dosyalar buradan зэkartэlэyor:"
INIT_WAIT = "Yьkleyicinin baюlamasэ bekleniyor.%nLьften Bekleyin."

; Custom prompts
CONVERT_CDROM = "%s CD-ROM resimleri direkt olarak зэkartэlamaz.  Bunun yerine, bu resim%n bir ISO CD-ROM resmine зevrilecek, bцylelikle зэkartэlabilecek.%n%nDevam etmek istiyor musunuz?%nNot: Bu iюlem birkaз dakika sьrebilir."
CONVERT_CDROM_STAGE1_FAILED = "Hata:  CD-ROM resmi зevrilemedi.%nEрer bu bir BIN/CUE resmi ise, lьtfen CUE dosyasэnэn dьzgьn formatlэ olduрundan emin olun."
CONVERT_CDROM_STAGE2_FAILED = "Hata:  Resimden bir ISO %sresmi oluюturuldu, fakat зevrilemedi.%nISO resmini ilerki bir analiz iзin saklamak ister misiniz ?"
CONVERT_BIN_MISSING = "Hata: Bunlar bulunamadэ:%n%s\%s.%s%n%nbu dosya %s.bin ve bu dosya %s.cue gerekli."
INIT_COMPLETE = "%s hazэrlanэyor.  Lьtfen yьkleyiciyi kapatэn, ve devam etmek iзin OK tuюuna basэn."
WISE_MSI_PROMPT = "Not:  Bu metod sadece Windows yьkleyici pakedi iзin цzel Wise ile зalэюэr.%nEрer Wise Yьkleyici Sihirbazэ baюlarsa ve giriю iзin beklerse, bu dosya%ndesteklenmemektedir.  Lьtfen yьkleyiciden зэkэn, ve %s зэkartmayэ iptal edin.%n%nDevam etmek ister misiniz?"
UNPACK_PROMPT = "Bu dosya sэkэюtэrma ile paketlenmiю %s ve sэkэюtэrэlmэю, ancak зэkartэlabilir.%nBunun sebebi dosya tipinin desteklenmemesi, yada%nзэkartэlacak hiзbir dosya iзermemesi olabilir.%n%nYine de bu dosyayэ зэkatmak istiyor musunuz?%n%nNot: Зэkartэlmэю dosyanэn ismi ve adresi bu olacaktэr:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Hata: %s%nзэkartэlamadэ."
WARN_EXECUTE = "Uyarэ:  Bu tip bir dosyayэ зэkartmak iзin, dosya direkt olarak зalэюtэrэlmalэdэr.%nEрer devam ederseniz, bu komut зalэюtэrэlacaktэr:%n%n%s%n%nEрer bu dosyanэn zararlэ olabileceрini dьюьnьyorsanэz, devam etmeniz цnerilmez.%nЗэkartma iюlemine devam etmek istiyor musunuz?"

; Help text
HELP_SUMMARY = "Herhangi bir arюivden yada yьkleme pakedinden dosya зэkart."
HELP_SYNTAX = "%nKullanэm:  %s [/yardэm] [dosya adэ [hedef]]"
HELP_ARGUMENTS = "%n%nDesteklenen konular:"
HELP_HELP = "%n     /yardэm%t%tBu yardэm bilgisini gцster"
HELP_FILENAME = "%n     dosya adэ%tЗэkartэlacak dosyanэn adэ"
HELP_DESTINATION = "%n     hedef%tЗэkartэlacak dosyanэn konumu"
HELP_SUB = "%n%nGeзiю /altdizin hedef dizin yerine%n%s arюivden sonra isimlendirilen alt dizin."
HELP_EXAMPLE1 = "%n%nЦrnek:"
HELP_EXAMPLE2 = "%n     %s c:\1\ornek.zip c:\test"
HELP_NOARGS = "%n%nHerhangi bir %s konudan baрэmsэz зalэюtэrmak%nkullanэcэya dosya adэ ve konumunu sorar."

; Error messages
CANNOT_LOG = "%s зэkartmalarэ kayda alэnamadэ."
CANNOT_DEBUG = "Onarэlan dosyanэn зэkэю klasцrь, "%s", yazэlabilir deрil.%nBunun yerine sizin temp klasцrьnьz kullanэlacak."
CANNOT_EXTRACT = "%s зэkartэlamaz.%nGeri dцnen dosya tipi : %s%n%nEрer dosyayэ kendiniz incelemek istiyorsanэz Tamam tuюuna basэn, yada зэkmak iзin Эptal tuюuna basэn."
UNKNOWN_EXT = "%s%nbilinmeyen bir uzantэya sahip ve зэkartэlamaz."
INVALID_DIR = "%s%noluюturulamadэ.  Lьtfen geзerli bir hedef belirtin."
EXTRACT_FAILED = "%s зэkartэlamadэ.%nGцrьnьюe gцre %s, desteklenen bir dosya tipi, ama зэkartma baюarэsэz oldu.%nLьtfen bilgi iзin kayэt dosyasэna  %s, bakэn.%n%nKayэt dosyasэnэ юimdi gцrmek iзin Tamam tuюuna basэn, yada зэkmak iзin Эptal tuюuna basэn."

[Installer]
; Components page
COMP_DOCS = "Dцkьmentasyon ve lisans bilgileri"
COMP_LANG = "Uluslararasэ destek iзin dil dosyalarэ"
COMP_ACE = "ACE dosyalarэ iзin destek"
COMP_KGB = "KGB dosyalarэ iзin destek"
COMP_PEA = "Pea dosyalarэ iзin destek"
COMP_SIT = "StuffIt dosyalarэ iзin destek"


; Preferences page
PREFS_CAPTION = "Program Ayarlarэnэ Yap"
PREFS_DESCRIPTION = "Hangi Universal Extractor ayarlarэnэ yapmak istersiniz?"
PREFS_LABEL1 = "Varsayэlan Universal Extractor davranэюlarэnэ iyileюtirmek iзin buradaki ayarlarэ kullanabilirsiniz."
PREFS_LABEL2 = "Buradaki ayarlarэ kurulum bittikten sonra UniExtract.ini dosyasэnэ kurcalayarak deрiюtirebilirsiniz."
LANGUAGE_LABEL = "Varsayэlan Dil"
DEBUG_LABEL = "Hata Ayэklama Dosyasэnэn Konumu"
APPEND_EXT_LABEL = "Eksik dosya &uzantэlarэnэ ekle"
HISTORY_LABEL = "&Arюiv geзmiюine bak"
REMOVE_DUPE_LABEL = "&Suret/зift dosyalarэ sil"
REMOVE_TEMP_LABEL = "&Geзici dosyalarэ sil"
WARN_EXECUTE_LABEL = "&Dosyalarэ зalэюtэmadan цnce uyar"


; Tasks page
ASSOCIATE = "E&xplorer iзerik menь tьmleюtiricisini aktif yap"
ASSOCIATE_FILES = "UniExtract &Dosya Ekle... iзerik menьsьne"
ASSOCIATE_HERE = "UniExtra&ct iзerik menьsьnde Buraya Ekle"
ASSOCIATE_SUBDIR = "UniExtract iзerik menьsьnde Altd&izin Ekle"
ASSOCIATE_FORCE = "Bilinen bьtьn arюiv formatlarэnda iюbirliрine &zorla"
MODIFY_PATH = "Sistem &yoluna Universal Extractor Ekle"

DESKTOP_ICON = "&Masaьstь ikonu oluюtur"
QUICK_LAUNCH_ICON = "&Hэzlэ Baюlata ikon oluюtur"
SENDTO_ICON = "Gцnder ikonu oluюtur"

; Context Menu integration
EXTRACT_FILES = "UniExtract Dosya s&eз..."
EXTRACT_HERE = "UniExtract Bu&raya"
EXTRACT_SUB = "UniExtract Al&tdizine"
